// Задача 1
// Большее из двух чисел

// if (firstNumber > secondNumber)
// {
//     Console.WriteLine("первое число больше");
// }
// else
// {
//    if (firstNumber < secondNumber)
// {
//     Console.WriteLine("второе число больше");
// }
// else
// {
//     Console.WriteLine("числа равны");



// Задача 2 Максимальное из 3 чисел int max = a;

//         if (max < b)
//         {
//             max = b;
//         }
//         if (max < c)
//         {
//             max = c;
//         }
//         return max;



// Задача 3 Проверка на четность

//  if (number % 2 == 0)
//         {
//         Console.Write("четное");
//         }
//           else
//           {
//             Console.Write("нечетное");
//           }
//     }





// Задача 4 На вход принимает число (number), а на выходе выводит все чётные числа от 1 до number (включительно), после каждого числа должен быть знак пробела

// int i = 1;
//       while (i <= number)
//     {
//         if (i % 2 == 0)
//         {
//         Console.Write(i + " ");
//       }
//       i++;
//     }

